app/controllers/destinations_controller.rb

SELECT "destinations".* FROM "destinations"
---
  def index
    @destination = Destination.all

SELECT "destinations".* FROM "destinations" WHERE "destinations"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def show
    @destination = Destination.find(params[:id])

INSERT INTO "destinations" ("country", "city", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["country", "Test"], ["city", "test"], ["description", "test"], ["created_at", "2023-01-08 05:01:33.061465"], ["updated_at", "2023-01-08 05:01:33.061465"]]
---
  def create
    #whitelisting the params
    @destination = Destination.new(params.require(:destination).permit(:country, :city, :description))
    #save to db
    if @destination.save

SELECT "destinations".* FROM "destinations" WHERE "destinations"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def edit
    @destination = Destination.find(params[:id])

SELECT "destinations".* FROM "destinations" WHERE "destinations"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "destinations" SET "description" = ?, "updated_at" = ? WHERE "destinations"."id" = ?  [["description", "test1"], ["updated_at", "2023-01-11 19:15:57.382479"], ["id", 13]]
---
  def update
    @destination = Destination.find(params[:id])
    if @destination.update(params.require(:destination).permit(:country, :city, :description))

SELECT "destinations".* FROM "destinations" WHERE "destinations"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "destinations" WHERE "destinations"."id" = ?  [["id", 9]]
---
  def destroy
    @destination = Destination.find(params[:id])
    @destination.destroy